In [3]:
my_dictionary = {
    "name": "person 1",
    "age": 35,
        "salary":400}

In [4]:
print(my_dictionary)

{'name': 'person 1', 'age': 35, 'salary': 400}

In [16]:
my_dictionary = {
    "name": ["Person 1","Person 2","Person 3","Person 4","Person 5"],
    "age":[35,100,35,78,67],
    "salary":[400,500,450,670,890],
}

In [17]:
my_dictionary

{'name': ['Person 1', 'Person 2', 'Person 3', 'Person 4', 'Person 5'],
 'age': [35, 100, 35, 78, 67],
 'salary': [400, 500, 450, 670, 890]}

In [29]:
 my_dictionary["location"] = ['ksm','nks','kisii','msa','eld']

In [20]:
my_dictionary

{'name': ['Person 1', 'Person 2', 'Person 3', 'Person 4', 'Person 5'],
 'age': [35, 100, 35, 78, 67],
 'salary': [400, 500, 450, 670, 890],
 'location': ['ksm', 'nks', 'kisii', 'msa', 'eld']}

In [23]:
for key, value in my_dictionary.items():
    print(key, value)

name ['Person 1', 'Person 2', 'Person 3', 'Person 4', 'Person 5']
age [35, 100, 35, 78, 67]
salary [400, 500, 450, 670, 890]
location ['ksm', 'nks', 'kisii', 'msa', 'eld']

In [24]:
import pandas as pd

In [ ]:
my_dictionary

In [25]:
{'name': ['Person 1', 'Person 2', 'Person 3', 'Person 4', 'Person 5'],
 'age': [35, 100, 35, 78, 67],
 'salary': [400, 500, 450, 670, 890]}j

{'name': ['Person 1', 'Person 2', 'Person 3', 'Person 4', 'Person 5'],
 'age': [35, 100, 35, 78, 67],
 'salary': [400, 500, 450, 670, 890]}

In [26]:
df = pd.DataFrame(my_dictionary)

In [27]:
df

       name  age  salary location
0  Person 1   35     400      ksm
1  Person 2  100     500      nks
2  Person 3   35     450    kisii
3  Person 4   78     670      msa
4  Person 5   67     890      eld

In [30]:
df["location"]

0      ksm
1      nks
2    kisii
3      msa
4      eld
Name: location, dtype: object

In [31]:
df[["name","age",]]

       name  age
0  Person 1   35
1  Person 2  100
2  Person 3   35
3  Person 4   78
4  Person 5   67

In [33]:
df["age"]

0     35
1    100
2     35
3     78
4     67
Name: age, dtype: int64

In [34]:
df["age"]+1

0     36
1    101
2     36
3     79
4     68
Name: age, dtype: int64

In [38]:
df['salary']+500

0     900
1    1000
2     950
3    1170
4    1390
Name: salary, dtype: int64

In [43]:
df["age"], df['salary'] = df["age"]+1, df['salary']+500
df

       name  age  salary location
0  Person 1   39    2400      ksm
1  Person 2  104    2500      nks
2  Person 3   39    2450    kisii
3  Person 4   82    2670      msa
4  Person 5   71    2890      eld

In [44]:
 df["age"]+1, df['salary']+500

(0     40
 1    105
 2     40
 3     83
 4     72
 Name: age, dtype: int64,
 0    2900
 1    3000
 2    2950
 3    3170
 4    3390
 Name: salary, dtype: int64)